app/Controllers/AuthentificationController.php

    public function authentification()
    {
        $UserModel          = new UserModel();
        $HistorySession     = new HistorySession();
        $session            = session();

        $rules = [
            'login'        => 'required|min_length[3]|trim' ,
            'password'     => 'required|min_length[3]|trim'
        ];

        //'file' => 'uploaded[file]|max_size[file,1024]|mime_in[file,text/csv,application/vnd.openxmlformats-officedocument.spreadsheetml.sheet]',
        if ($this->validate($rules)) {
            $login = $this->request->getvar('login');
            $password = $this->request->getvar('password');

            if ($login == NULL || $password == NULL) {
                $response = [
                    "success" => false,
                    'motif'   => 'error',
                    "status"  => 500,
                    "code"    => "error",
                    "title"   => "Erreur",
                    "msg"     => "le login ou mot de passe est obigatoire",
                ];
                return $this->respond($response);
            }else{
                $user = $UserModel->where('login', strtolower($login))->first();
---
SELECT *
FROM `users`
WHERE `login` = 'admin'
 LIMIT 1