app/Models/ProduitModel.php

SELECT *
FROM `produit`
JOIN `categorie` ON `produit`.`idCategorie` = `categorie`.`idCategorie`
WHERE `produit`.`is_delete` = 0
---
    public function getAllProduit(){
        $builder = $this->db->table('produit');
        $builder->select("*");
        $builder->join('categorie','produit.idCategorie = categorie.idCategorie');
        $builder->where('produit.is_delete', false);

        $res  = $builder->get();